Repository: OddOneOut/Better-WordPress-Syntax
Catalog: languages/bwp-syntax-*.po
Languages: fr_fr

source: %s requires WordPress <strong>%s</strong> or higher and PHP <strong>%s</strong> or higher. The plugin will not function until you update your software. Please deactivate this plugin.
fr_fr: %s requiert WordPress <strong>%s</strong> ou plus et PHP <strong>%s</strong> ou plus. Le plugin ne fonctionnera pas tant que vous n'aurez pas mis à jour votre logiciel. Merci de désactiver ce plugin.

source: Development Log
fr_fr: Log de développement

source: Frequently Asked Questions
fr_fr: Foire Aux Questions

source: Got a problem? Send me a feedback!
fr_fr: Un problème ? Dites-le moi !

source: You can buy me some special coffees if you appreciate my work, thank you!
fr_fr: Vous pouvez m'offrir des cafés spéciaux si vous appréciez mon travail, merci !

source: Donate to
fr_fr: Faire un don à

source: One cup $5.00
fr_fr: Une tasse $5.00

source: Two cups $10.00
fr_fr: Deux tasses $10.00

source: Five cups! $25.00
fr_fr: Cinq tasses ! $25.00

source: One LL-cup!!! $50.00
fr_fr: Une tasse géante ! $50.00

source: ... or any amount!
fr_fr: ou n'importe quel montant !

source: Latest updates from BetterWP.net!
fr_fr: Dernières mises à jour de BetterWP.net !

source: Follow me on Twitter!
fr_fr: Suivez-moi sur Twitter !

source: This Plugin is Proudly Sponsored By
fr_fr: Ce plugin est fièrement propulsé par

source: You are using version %s!
fr_fr: Vous utilisez la version %s !

source: Settings
fr_fr: Réglages

source: General Options
fr_fr: Options générales

source: Theme Options
fr_fr: Options de thème

source: BWP Syntax General Options
fr_fr: BWP Syntax Options générales

source: BWP Syntax Theme Options
fr_fr: BWP Syntax Options de thème

source: You do not have sufficient permissions to access this page.
fr_fr: Vous n'avez pas d'autorisations suffisantes pour accéder à cette page.

source: Parse Options
fr_fr: Options d'analyse

source: This plugin will parse
fr_fr: Ce plugin va analyser

source: Search and remove nested shortcodes?
fr_fr: Rechercher et supprimer les shortcodes imbriqués ?

source: Parse code inside comments?
fr_fr: Analyser le code à l'intérieur des commentaires ?

source: Default lang if none specified
fr_fr: Langue par défaut si aucune spécifiée

source: Display Options
fr_fr: Options d'affichage

source: Show line numbers?
fr_fr: Afficher les numéros de ligne ?

source: Hide the codeblock by default?
fr_fr: Masquer le bloc de code par défaut ?

source: Miscellaneous
fr_fr: Divers

source: Load only on single pages?
fr_fr: Charger uniquement sur les articles ?

source: Give the author credits?
fr_fr: Afficher les crédits de l'auteur ?

source: <em>Choose what type of code parsing methods you want. By default this plugin will not parse codes inside the famous shortcode <code>[code]</code>, you can ask the plugin to do so, but it is <strong>not recommended</strong>; Even if you choose to do so, the plugin will only parse for your post content, not comment text. The reasons are described in this <a href="%s#notes" target="_blank">note</a>.</em>
fr_fr: <em>Choisissez quelle méthode d'analyse de code vous souhaitez. Par défaut, ce plugin n'analysera pas le code dans les fameux shortcodes <code>[code]</code>. Vous pouvez demander au plugin de le faire mais ce n'est <strong>pas recommandé</strong>. Même si vous choisissez de le faire, le plugin analysera uniquement le contenu des articles et non celui des commentaires. Les raisons sont décrites dans cette <a href="%s#notes" target="_blank">note</a>.</em>

source: <em>Other options that fit nowhere.</em>
fr_fr: <em>Autres options qui conviennent nulle part.</em>

source: <em>Some general display options.</em>
fr_fr: <em>Quelques options générales d'affichage.</em>

source: This plugin will only load if is_singular() returns true.
fr_fr: Ce plugin ne sera chargé que si is_singular() renvoie true.

source: Show the line number next to each line of code.
fr_fr: Afficher le numéro de ligne à côté de chaque ligne de code.

source: Add <code>inline="yes"</code> to the shortcode and this plugin will output codes inside <code>&lt;code&gt;</code> tag.
fr_fr: Ajoutez <code>inline="yes"</code> au shortcode et ce plugin affichera du code dans la balise <code>&lt;code&gt;</code>.

source: codes inside <code>&lt;code&gt;</code> tags.
fr_fr: code dans la balise <code>&lt;code&gt;</code>

source: <strong>Warning:</strong> This might cause performance issues if there are too many comments with codes inside. You can use a cache plugin to deal with such problem. This option might be improved in the future, though.
fr_fr: <strong>Attention :</strong> Cela pourrait causer des problèmes de performance si il ya trop de commentaires avec du code à l'intérieur. Vous pouvez utiliser un plugin de cache pour faire face à ce problème. Cette option pourrait être améliorée à l'avenir.

source: A link to this plugin's official page will be visible to your visitors. The link is added next to the view source icon. Thank you!
fr_fr: Un lien vers la page officielle de ce plugin sera visible pour vos lecteurs. Le lien est ajouté à côté de l'icône "voir la source". Merci !

source: codes inside <code>&lt;pre&gt;</code> tags.
fr_fr: code dans la balise <code>&lt;pre&gt;</code>.

source: codes inside <code>[code]</code> shortcodes.
fr_fr: code dans le shortcode <code>[code]</code>

source: Outputs are hidden by default to decrease post's length. Visitors will then click on folded codeblocks to toggle.
fr_fr: Le blocs de code sont masqués par défaut pour diminuer la longueur des articles. Les visiteurs pourront alors cliquer sur les blocs de code repliés pour les afficher.

source: If you choose to parse both <code>&lt;pre&gt;</code> or <code>&lt;code&gt;</code> with <code>[code]</code>, you should enable this to avoid nesting problem, such as <code>&lt;pre&gt;[code][/code]&lt;/pre&gt;</code>. This might cause some extremely long codeblock to fail to load. Follow the link in the note above for more details.
fr_fr: Si vous choisissez d'analyser à la fois <code>&lt;pre&gt;</code> ou <code>&lt;code&gt;</code> avec <code>[code]</code>, vous devez activer ceci pour éviter les problèmes d'imbrication comme <code>&lt;pre&gt;[code][/code]&lt;/pre&gt;</code>. Cela pourrait provoquer qu'un très long bloc de code ne puisse pas charger. Cliquez sur le lien dans la note ci-dessus pour plus de détails.

source: No syntax highlighting
fr_fr: Pas de coloration syntaxique

source: Show a vertical scrollbar when there are more than
fr_fr: Afficher une barre de défilement verticale quand il ya plus de

source: Each line will be
fr_fr: Chaque ligne fera

source: Each tab will equal
fr_fr: Chaque tabulation sera égale à

source: A code block will be
fr_fr: Un bloc de code fera

source: Output a code block as
fr_fr: Affichage d'un bloc de code

source: Style a code block
fr_fr: Style d'un bloc de code

source: Style a code block using
fr_fr: Styler un bloc de code en utilisant

source: Show the toolbar
fr_fr: Afficher la barre d'outils

source: Load CSS, JS only when needed?
fr_fr: Charger les CSS et JS qu'en cas de besoin ?

source: Preview your preference
fr_fr: Aperçu de votre préférence

source: Type some codes here
fr_fr: Tapez quelques lignes de code ici

source: Choose a language
fr_fr: Choisissez un langage

source: Generate language-based css
fr_fr: Génère une css basée sur le langage

source: Type in your desired language
fr_fr: Entrez le langage souhaité

source: This section allows you to preview how the codeblock will look. It might not be accurate since the styles of the admin page and your actual page differ but generally it should be the same. Note that this generates codeblock basing on your preference.
fr_fr: Cette section vous permet de prévisualiser à quoi les blocs de code vont ressembler. Cela pourrait ne pas être précis, car les styles de la page d'administration et du thème de votre blog diffèrent, mais en général, cela devrait être identique. Notez que cela génère un bloc de code se basant sur vos préférences.

source: This section allows you to generate styles for custom languages. Note that if you choose to style globally or use inline styles, simply ignore this. Visit <a href="%s#notes">here</a> for more details.
fr_fr: Cette section vous permet de générer des styles de langages personnalisés. Notez que si vous choisissez de styler globalement ou utiliser les styles en ligne, ignorez simplement cela. Visitez <a href="%s#notes">ce lien</a> pour plus de détails.

source: This is only useful when you do not use any minify or cache plugin.
fr_fr: Ce n'est utile que si vous n'utilisez pas de plugin de cache ou de minify.

source: Ordered List
fr_fr: Liste ordonnée

source: Inline styles
fr_fr: Styles en ligne

source: CSS classes
fr_fr: Classes CSS

source: Based on the language
fr_fr: Basé sur le langage

source: Globally
fr_fr: Global

source: Before Codeblock
fr_fr: Avant le bloc de code

source: After Codeblock
fr_fr: Après le bloc de code

source: Do not show
fr_fr: De pas afficher

source: lines of codes. Type 0 for no vertical bar.
fr_fr: lignes de code. Tapez 0 pour supprimer la barre verticale.

source: pxs high. This should be the line-height you define in CSS (plus any margin or padding).
fr_fr: px de haut. Cela devrait être le line-height que vous définissez dans la CSS (plus des margins ou paddings).

source: spaces. This is used by the Ordered List output method.
fr_fr: espaces. Ceci est utilisé pour la méthode d'affichage en listes ordonées.

source: pxs wide. By default (0), the code block will stretch to its container. If you choose to output the code block as an Ordered List, this should be wider than 500 pixels.
fr_fr: px de large. Par défaut (0), le bloc de code s'adaptera à son conteneur. Si vous choisissez d'afficher les blocs de code en listes ordonées, cela devrait être plus large que 500 pixels.

source: You need to specify the correct language name defined within GeSHi. Look for the language name inside geshi.php, near line 1442
fr_fr: Vous devez spécifier le nom correct du langage définie dans GeSHi. Recherchez le nom de la langue à l'intérieur geshi.php, près de la ligne 1442

source: <em><strong>Note:</strong> "Table" means the output consists of a table with one row and two columns. The first column will hold line numbers while the second column will hold the code. "Ordered List" will generate each line of code in a list item. The advantage of this is you can have a different color for each line but in exchange for more complicated styling and some weird browser behaviours. I suggest using the preview feature below to experiment with each method. For more information, please consult the <a href="http://qbnz.com/highlighter/geshi-doc.html#line-numbers" target="_blank">GeSHi documentation</a>.</em>
fr_fr: <em><strong>Remarque :</strong> "Table" veut dire qu'il affichera un tableau avec des lignes et deux colonnes. La première colonne contiendra les numéros de ligne tandis que la deuxième colonne contiendra le code. "Liste ordonée" va générer chaque ligne de code dans un élément de liste. L'avantage est que vous pouvez avoir une couleur différente pour chaque ligne en contrepartie d'un style plus complexe et de certains comportements étranges des navigateurs. Je suggère d'utiliser la fonction de prévisualisation ci-dessous pour faire vos tests avec chaque méthode. Pour plus d'informations, merci de consulter la <a href="http://qbnz.com/highlighter/geshi-doc.html#line-numbers" target="_blank">documentation de GeSHi</a>.</em>

source: <em><strong>Note:</strong> If you choose to style globally, this plugin will style your codeblocks the same regardless of languages. Styling globally might save you some kbs if you need tons of languages for your blog. Also, if you choose to style based on languages and do not want to use CSS, you can use inline styles, which also saves you some kbs (only a simple CSS file is needed). It is recommended that, however, you use CSS classes.</em>
fr_fr: <em><strong>Remarque :</strong> si vous choisissez de styler globalement, ce plugin stylera vos blocs de code de la même façon quel que soit le langage. Styler globalement vous permettra d'économiser quelques kilo-octets si vous avez besoin de plusieurs langages pour votre blog. Aussi, si vous choisissez de styler selon le langage et ne voulez pas utiliser de CSS, vous pouvez utiliser le style en ligne, qui vous fera également économiser quelques kilo-octets (un simple fichier CSS est nécessaire). C'est recommandé sauf si vous utilisez des classes CSS.</em>

source: <em><strong>Note:</strong> The toolbar consists of a view source icon and a credit link if enabled. The view source button allows visitors to copy preformatted code with tabs and spaces untouched.</em>
fr_fr: <em><strong>Remarque :</strong> la barre d'outils se compose d'une icône "voir la source" et du lien des crédits si il est activé. Le bouton "voir la source" permet aux lecteurs de copier le code préformaté en concervant les tabulations et les espaces.</em>

source: View Source Code
fr_fr: Voir le code source

source: Better WordPress Syntax Plugin
fr_fr: Plugin Better WordPress Syntax

source: Click to toggle codeblock
fr_fr: Cliquez pour afficher le bloc de code

source: Sorry, but you do not have the permission to view this file.
fr_fr: Désolé, vous n'avez pas la permission d'accéder à ce fichier.

source: Language
fr_fr: Langage

source: Inline
fr_fr: En ligne

source: Select an inline mode
fr_fr: Sélectionner un mode en ligne

source: Plugin Configurations
fr_fr: Configuration du plugin

source: Save Changes
fr_fr: Enregistrer les modifications
